In [1]:

import pandas as pd
import numpy as np

In [3]:
%cd ..

/Users/tantri/Documents/My Research Material/UTSSpring23/AdvancedML/AT2/Retail_Analytics/American_Retail_Sales/notebooks

In [4]:
# Read the CSV file
sales_train = pd.read_csv('../data/raw/sales_train.csv', low_memory=False)
sales_test= pd.read_csv('../data/raw/sales_test.csv', low_memory=False)
items_weekly_sell_prices= pd.read_csv('../data/raw/items_weekly_sell_prices.csv', low_memory=False)
calendar= pd.read_csv('../data/raw/calendar.csv', low_memory=False)
calendar_events= pd.read_csv('../data/raw/calendar_events.csv', low_memory=False)

In [6]:
sales_train.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1532,d_1533,d_1534,d_1535,d_1536,d_1537,d_1538,d_1539,d_1540,d_1541
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,1,1,0,1,0,1,0,0,1
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,8,2,0,8,2,3,1,1,3,8
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,0,1,3,2,1,1,2,2,3

In [7]:
items_weekly_sell_prices.head()

  store_id        item_id  wm_yr_wk  sell_price
0     CA_1  HOBBIES_1_001     11325        9.58
1     CA_1  HOBBIES_1_001     11326        9.58
2     CA_1  HOBBIES_1_001     11327        8.26
3     CA_1  HOBBIES_1_001     11328        8.26
4     CA_1  HOBBIES_1_001     11329        8.26

In [8]:
import pandas as pd


# Group by 'store_id' and 'wm_yr_wk' and calculate the number of unique 'item_id'
result = items_weekly_sell_prices.groupby(['wm_yr_wk', 'store_id'])['item_id'].nunique().reset_index()

# I can then select one row for each combination, for example, the first row
one_row_per_combination = result.head(1)

# Print the result
print(one_row_per_combination)

   wm_yr_wk store_id  item_id
0     11101     CA_1     1204

In [9]:
calendar.head()

         date  wm_yr_wk    d
0  2011-01-29     11101  d_1
1  2011-01-30     11101  d_2
2  2011-01-31     11101  d_3
3  2011-02-01     11101  d_4
4  2011-02-02     11101  d_5

In [10]:
unique_weekid_count = calendar['wm_yr_wk'].nunique()
print("Number of unique weeks:", unique_weekid_count)

Number of unique weeks: 282

In [11]:
calendar_events.head()

         date     event_name event_type
0  2011-02-06      SuperBowl   Sporting
1  2011-02-14  ValentinesDay   Cultural
2  2011-02-21  PresidentsDay   National
3  2011-03-09      LentStart  Religious
4  2011-03-16      LentWeek2  Religious

In [12]:

# Find duplicate dates
duplicate_dates = calendar_events[calendar_events['date'].duplicated(keep=False)]

# Display duplicate dates
print(duplicate_dates)

           date      event_name event_type
7    2011-04-24          Easter   Cultural
8    2011-04-24  OrthodoxEaster  Religious
69   2013-05-05   Cinco De Mayo   Cultural
70   2013-05-05  OrthodoxEaster  Religious
97   2014-04-20          Easter   Cultural
98   2014-04-20  OrthodoxEaster  Religious
104  2014-06-15    Father's day   Cultural
105  2014-06-15    NBAFinalsEnd   Sporting
165  2016-06-19    Father's day   Cultural
166  2016-06-19    NBAFinalsEnd   Sporting

In [13]:
# Step 1: Create a DataFrame with event counts for each date
event_counts = calendar_events['date'].value_counts().reset_index()
event_counts.columns = ['date', 'event_count']


# Step 2: Merge the event count DataFrame with the original calendar_events DataFrame
calendar_events = pd.merge(calendar_events, event_counts, on='date', how='left')

# Step 3: Drop duplicates based on the 'date' column
calendar_events = calendar_events.drop_duplicates('date', keep='first')

In [14]:
# Create a dictionary to map 'd_' labels to dates
date_mapping = dict(zip(calendar['d'], calendar['date']))

# Rename the 'd_' columns in df_1 with their respective dates
sales_train.rename(columns=date_mapping, inplace=True)

# Now, the 'd_1', 'd_2', ... columns in df_1 will be renamed with their corresponding dates

In [15]:
sales_train.head()

,id,item_id,dept_id,cat_id,store_id,state_id,2011-01-29,2011-01-30,2011-01-31,2011-02-01,...,2015-04-09,2015-04-10,2015-04-11,2015-04-12,2015-04-13,2015-04-14,2015-04-15,2015-04-16,2015-04-17,2015-04-18
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,1,1,0,1,0,1,0,0,1
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,8,2,0,8,2,3,1,1,3,8
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,0,1,3,2,1,1,2,2,3

In [16]:
long_format_sales = pd.melt(sales_train, id_vars=['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id'],
                            var_name='date', value_name='units_sold')

In [17]:
long_format_sales.count()

id            46985090
item_id       46985090
dept_id       46985090
cat_id        46985090
store_id      46985090
state_id      46985090
date          46985090
units_sold    46985090
dtype: int64

In [18]:
long_format_sales.head()

,id,item_id,dept_id,cat_id,store_id,state_id,date,units_sold
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0

In [19]:
import pandas as pd

# Create a DataFrame to map dates to weeks
date_to_week_mapping = calendar[['date', 'wm_yr_wk']]

# Merge the long-format sales data with the date-to-week mapping
combined_data = pd.merge(long_format_sales, date_to_week_mapping, on='date')



# Now, combined_data contains sales data for each product on each date

In [22]:
combined_data.count()

id            46985090
item_id       46985090
dept_id       46985090
cat_id        46985090
store_id      46985090
state_id      46985090
date          46985090
units_sold    46985090
wm_yr_wk      46985090
sell_price    34720691
sales         34720691
dtype: int64

In [21]:
import pandas as pd

# Perform a left join to merge the dataframes
combined_data = pd.merge(combined_data, items_weekly_sell_prices, on=['item_id', 'wm_yr_wk', 'store_id'], how='left')

# Calculate sales by multiplying sell_price with units_sold
combined_data['sales'] = combined_data['sell_price'] * combined_data['units_sold']

In [23]:
ItemCount = combined_data['item_id'].nunique()
print("Number of unique items:", ItemCount)


StoreCount = combined_data['store_id'].nunique()
print("Number of unique stores:", StoreCount)

Number of unique items: 3049
Number of unique stores: 10

In [24]:
# Sort the DataFrame by "store_id," "date," and "item_id"
combined_data = combined_data.sort_values(by=['store_id', 'item_id'])

# Reset the index if needed
combined_data.reset_index(drop=True, inplace=True)

In [28]:
# Import the pandas library
import pandas as pd

# Forward fill missing values in the "sell_price" 
combined_data['sell_price'].fillna(method='ffill', inplace=True)

In [30]:
combined_data['sales'] = combined_data['sell_price'] * combined_data['units_sold']

In [31]:
combined_data.count()

id            46985090
item_id       46985090
dept_id       46985090
cat_id        46985090
store_id      46985090
state_id      46985090
date          46985090
units_sold    46985090
wm_yr_wk      46985090
sell_price    46985090
sales         46985090
dtype: int64

In [ ]:
save_path = '../data/processed/final_merged_events.csv'

# Save the DataFrame as a CSV file
combined_data.to_csv(save_path, index=False)

In [32]:
combined_data_with_events = pd.merge(combined_data, calendar_events, on='date', how='left')

In [34]:
combined_data_with_events.drop('event_type', axis=1, inplace=True)
combined_data_with_events['event_count'].fillna(0, inplace=True)
combined_data_with_events['event_name'].fillna('NoEvent', inplace=True)

In [35]:
combined_data_with_events.count()

id             46985090
item_id        46985090
dept_id        46985090
cat_id         46985090
store_id       46985090
state_id       46985090
date           46985090
units_sold     46985090
wm_yr_wk       46985090
sell_price     46985090
sales          46985090
event_name     46985090
event_count    46985090
dtype: int64

In [ ]:
save_path = '../data/processed/final_merged_events.csv'

# Save the DataFrame as a CSV file
combined_data_with_events.to_csv(save_path, index=False)

In [ ]:
#Test data preparation

In [ ]:
import pandas as pd

# Assuming df_1 and df have the same number of rows
merged_df = pd.concat([sales_train, sales_test], axis=1)

In [ ]:
# Generate a list of date columns to drop
date_columns_to_drop = [f'd_{i}' for i in range(1, 1542)]  # Creates a list from 'd_1' to 'd_1541'

# Drop the date columns
merged_df.drop(columns=date_columns_to_drop, inplace=True)

In [ ]:
# Assuming df_1 contains your sales data and df_3 contains the date mapping
# Create a dictionary to map 'd_' labels to dates
date_mapping = dict(zip(calendar['d'], calendar['date']))

# Rename the 'd_' columns in df_1 with their respective dates
merged_df.rename(columns=date_mapping, inplace=True)

# Now, the 'd_1', 'd_2', ... columns in df_1 will be renamed with their corresponding dates

In [ ]:
long_format_sales = pd.melt(merged_df, id_vars=['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id'],
                            var_name='date', value_name='units_sold')

In [ ]:
import pandas as pd

# Create a DataFrame to map dates to weeks
date_to_week_mapping = calendar[['date', 'wm_yr_wk']]

# Merge the long-format sales data with the date-to-week mapping
test_combined_data = pd.merge(long_format_sales, date_to_week_mapping, on='date')



# Now, combined_data contains sales data for each product on each date

In [ ]:
import pandas as pd

# Perform a left join to merge the dataframes
test_combined_data = pd.merge(test_combined_data, items_weekly_sell_prices, on=['item_id', 'wm_yr_wk', 'store_id'], how='left')

# Calculate sales by multiplying sell_price with units_sold
test_combined_data['sales'] = test_combined_data['sell_price'] * test_combined_data['units_sold']

In [ ]:
# Sort the DataFrame by "store_id," "date," and "item_id"
test_combined_data = test_combined_data.sort_values(by=['store_id', 'item_id'])

# Reset the index if needed
test_combined_data.reset_index(drop=True, inplace=True)

In [ ]:
test_combined_data = pd.merge(test_combined_data, calendar_events, on='date', how='left')

In [ ]:
test_combined_data.drop('event_type', axis=1, inplace=True)
test_combined_data['event_count'].fillna(0, inplace=True)
test_combined_data['event_name'].fillna('NoEvent', inplace=True)

In [ ]:
save_path = '../data/processed/test_final_merged.csv'

# Save the DataFrame as a CSV file
test_combined_data.to_csv(save_path, index=False)